IRP/src/Catalogs/ItemSegments/ItemSegments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemSegments</name>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/ItemSegments/ItemSegments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>ItemSegments</name>
 <dimensions>
  <name>Segment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Specification</name>
  <type>
   <types>CatalogRef.Specifications</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultBillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </attributes>
 <attributes>
  <name>UseIncomingStockReservation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecificationAffectPricingMD5</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricingMD5</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemSegments/ManagerModule.bsl
Procedure SaveItemsToSegment(Segment, ItemRefs) Export
	
	Query = New Query;
	Query.SetParameter("Refs", ItemRefs);
	Query.SetParameter("Segment", Segment);
	
	If ItemRefs.Count() > 0 And TypeOf(ItemRefs[0]) = Type("CatalogRef.ItemKeys") Then
		Query.Text =
		"SELECT
		|	&Segment,
		|	ItemKeys.Ref AS ItemKey,
		|	ItemKeys.Item
		|FROM
		|	Catalog.ItemKeys AS ItemKeys
		|		LEFT JOIN InformationRegister.ItemSegments AS ItemSegments
		|		ON ItemSegments.Segment = &Segment
		|		AND ItemKeys.Ref = ItemSegments.ItemKey
		|WHERE
		|	ItemKeys.Ref IN (&Refs)
		|	AND ItemSegments.Segment IS NULL";
	Else
		Query.Text =
		"SELECT
		|	&Segment,
		|	VALUE(Catalog.ItemKeys.EmptyRef) AS ItemKey,
		|	Items.Ref AS Item
		|FROM
		|	Catalog.Items AS Items
		|		LEFT JOIN InformationRegister.ItemSegments AS ItemSegments
		|		ON ItemSegments.Segment = &Segment
		|		AND Items.Ref = ItemSegments.Item
		|		AND ItemSegments.ItemKey = VALUE(Catalog.ItemKeys.EmptyRef)
		|WHERE
		|	Items.Ref IN (&Refs)
		|	AND ItemSegments.Segment IS NULL";
	EndIf;
	
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		Record = InformationRegisters.ItemSegments.CreateRecordManager();
		FillPropertyValues(Record, QuerySelection);
		Record.Write();
	EndDo;
	
EndProcedure

Procedure CheckContent(Segment) Export
	
	Query = New Query;
	Query.SetParameter("Segment", Segment);
	Query.Text =
	"SELECT
	|	ItemKeySegments.Segment,
	|	ItemKeySegments.ItemKey,
	|	ItemKeySegments.Item
	|FROM
	|	InformationRegister.ItemSegments AS ItemKeySegments
	|		INNER JOIN InformationRegister.ItemSegments AS ItemSegments
	|		ON ItemKeySegments.Segment = ItemSegments.Segment
	|		AND ItemKeySegments.Item = ItemSegments.Item
	|		AND ItemSegments.ItemKey = VALUE(Catalog.ItemKeys.EmptyRef)
	|WHERE
	|	ItemKeySegments.Segment = &Segment
	|	AND ItemKeySegments.ItemKey <> VALUE(Catalog.ItemKeys.EmptyRef)";
	
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		Record = InformationRegisters.ItemSegments.CreateRecordManager();
		FillPropertyValues(Record, QuerySelection);
		Record.Delete();
	EndDo;	
	
	Query.Text =
	"SELECT
	|	ItemSegments.Segment,
	|	ItemSegments.ItemKey,
	|	ItemSegments.ItemKey.Item
	|FROM
	|	InformationRegister.ItemSegments AS ItemSegments
	|WHERE
	|	ItemSegments.Segment = &Segment
	|	AND ItemSegments.ItemKey <> VALUE(Catalog.ItemKeys.EmptyRef)
	|	AND ItemSegments.Item = VALUE(Catalog.Items.EmptyRef)";
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		RecordSet = InformationRegisters.ItemSegments.CreateRecordSet();
		RecordSet.Filter.Segment = QuerySelection.Segment;
		RecordSet.Filter.ItemKey = QuerySelection.ItemKey;
		
		RecordRow = RecordSet.Add();
		FillPropertyValues(RecordRow, QuerySelection);
		Record.Write(True);
	EndDo;
	
EndProcedure
